export const theoryContent: Record<string, string> = {
  procedure: `
  <div>
    <p>
      Экзамен по английскому языку состоит из 2-х частей: письменной и устной. В 2026 году
      экзамен проходит 6 июня.
    </p>
    <p>
      Максимальный балл за этот экзамен — 70. За письменную часть можно получить 55 баллов (15
    за аудирование+15 за чтение+15 за грамматику и лексику/языковой материал+10 за письмо).
    Сумма баллов за устную часть — 15 (2 за чтение текста+6 за ответы в диалоге-расспросе+7 за
    тему).
    </p>
    <p>Соответствие баллов ОГЭ отметкам:</p>
    <p>
      59-70 - «5»<br/>
      46-58 - «4»<br/>
      29-45 - «3»<br/>
      0-28 - «2»
    </p>
    <p>
      Письменная часть продолжается 120 минут (30 минут на аудирование+30 минут на чтение+30
      минут на грамматику и лексику+30 минут на письмо).<br/>
      Продолжительность устной части — 15 минут.
    </p>
  </div>
  `,
  listening: `
  <div>
    <p>
      Для развития навыков аудирования полезно слушать запись несколько раз: первый раз только
      слушаем, второй раз слушаем и следим по тексту, третий раз снова только слушаем.<br/>
      При выполнении заданий обращайте внимание на пояснение ответов. При необходимости
      слушайте запись снова.<br/>
      Просмотр сериалов и мультфильмов на английском также поможет Вам улучшить понимание
      звучащей речи.
    </p>
  </div>
  `,
  reading: `
  <div>
    <p>
      При выполнении первого задания (соотнести заголовки и тексты) Вам необходимо знать перевод
      заголовка и приблизительно понимать содержание текста. Постарайтесь перевести все заголовки,
      которые есть в заданиях открытого банка ФИПИ.
    </p>
    <p>
      Сложный момент во втором задании на чтение (текст с утверждениями на true/false/not stated) —
      это различие false и not stated. Если в тексте есть явное опровержение того, о чем сказано в
      утверждении, это false. Если в тексте отсутствует информация, запрошенная в утверждении, —
      это not stated. Не додумывайте и не делайте выводы на основе Ваших предположений.
      Опирайтесь только на то, о чём написано в тексте.
    </p>
  </div>
  `,
  "language-material": `
  <div>
    <p>
      В приложении проработаны абсолютно все задания этого раздела, поэтому тренируйте их
      почаще. Не забывайте обращаться к разделу «теория → языковой материал», в котором даны
      правила и примеры на все грамматические темы, которые могут встретиться на экзамене.
    </p>
  </div>
  `,
  writing: `
  <div>
    <p>
      Выполнение всех условий, указанных и разделе «теория→ письмо», и выполнение упражнений
      принесёт Вам высокий балл. Для более точной оценки посмотрите критерии оценивания
      личного письма в демоверсии ОГЭ.
      Тренируйтесь писать письма на разные темы (их можно найти на сайте Открытый банк заданий
      ОГЭ → английский → письмо) и проверяйте, все ли критерии Вы выполнили. Желательно
      попросить преподавателя, знакомого с критериями оценивания, проверить несколько работ и
      поставить баллы.
    </p>
  </div>
  `,
};
